# -*- coding: utf-8 -*-

# 2 Задание

a = int(input("Длина первого катета: "))
b = int(input("Длина второго катета: "))
s = 1/2 * a *b
print("Ответ: ", s)

print("\n")